# read design 
read_verilog cajero.v

# elaborate design hierarchy
hierarchy -check -top cajero

# the high-level stuff
proc; opt; fsm; opt; memory; opt

# mapping to internal cell library
techmap; opt

# write verilog file
write_verilog cajero_rtlil.v

