# Leer la biblioteca de celdas CMOS
read_liberty -lib cmos_cells.lib

# Leer el archivo de diseño
read_verilog control_de_acceso.v

# Ejecutar la síntesis, especificando el módulo top
synth

# Realizar el mapeo tecnológico usando la biblioteca cmos_cells
dfflibmap -liberty cmos_cells.lib
abc -liberty cmos_cells.lib

# Escribir la descripción estructural del diseño en Verilog
write_verilog sintetizado.v
